In [3]:
import pandas as pd
import numpy as np

In [8]:
df = pd.DataFrame([["Rob", 5000], ["Rafiq", 5000],["Nina", 5000],["Sofia", 5000],["Mohan", 5000],["Tao", 5000],["Musk", 10000000]], columns = ["name", "income"])

In [9]:
df

    name    income
0    Rob      5000
1  Rafiq      5000
2   Nina      5000
3  Sofia      5000
4  Mohan      5000
5    Tao      5000
6   Musk  10000000

In [10]:
df.describe()

             income
count  7.000000e+00
mean   1.432857e+06
std    3.777755e+06
min    5.000000e+03
25%    5.000000e+03
50%    5.000000e+03
75%    5.000000e+03
max    1.000000e+07

In [21]:
df.income.quantile(1)

10000000.0

In [25]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400299.999999994

In [29]:
df_no_outlier = df[df.income<=percentile_99]
df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    5000
2   Nina    5000
3  Sofia    5000
4  Mohan    5000
5    Tao    5000

In [30]:
df

    name    income
0    Rob      5000
1  Rafiq      5000
2   Nina      5000
3  Sofia      5000
4  Mohan      5000
5    Tao      5000
6   Musk  10000000

In [34]:
df.iloc[3]["income"] = np.NaN
df

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_24128\3237639413.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.iloc[3]["income"] = np.NaN

    name    income
0    Rob      5000
1  Rafiq      5000
2   Nina      5000
3  Sofia      5000
4  Mohan      5000
5    Tao      5000
6   Musk  10000000